---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.PageOrientation
source: html/96d27272-150f-d3dc-475c-0f15584e2048.htm
---
# Autodesk.Revit.DB.PrintParameters.PageOrientation Property

The Page Orientation of the Print Setting.

## Syntax (C#)
```csharp
public PageOrientationType PageOrientation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - Thrown when the input argument is out of range.